stm32-hotspot/X-CUBE-MATTER-Extension/Projects/NUCLEO-WBA65RI/Applications/Matter/Lighting-App/Core/Src/app_entry.cpp
#if (CFG_BUTTON_SUPPORTED == 1)
void APP_BSP_Button1Action( void )
{
    ButtonDesc_t Message;
    Message.button = B1;
    Message.State = APP_BSP_ButtonIsPressed(B1);
    if (Message.State)
	{
		Message.longPressed = APP_BSP_ButtonIsLongPressed(B1);
	}
	else
	{
		Message.longPressed = APP_BSP_ButtonWasLongPressed(B1);
	}
    PbCb(&Message); //call matter callback to handle push button
}

void APP_BSP_Button2Action( void )
{
    ButtonDesc_t Message;
    Message.button = B2;
    Message.State = APP_BSP_ButtonIsPressed(B2);
    if (Message.State)
	{
		Message.longPressed = APP_BSP_ButtonIsLongPressed(B2);
	}
	else
	{
		Message.longPressed = APP_BSP_ButtonWasLongPressed(B2);
	}
    PbCb(&Message); //call matter callback to handle push button
}

void APP_BSP_Button3Action( void )
{
    ButtonDesc_t Message;
    Message.button = B3;
    Message.State = APP_BSP_ButtonIsPressed(B3);
    if (Message.State)
    {
    	Message.longPressed = APP_BSP_ButtonIsLongPressed(B3);
    }
    else
    {
    	Message.longPressed = APP_BSP_ButtonWasLongPressed(B3);
    }
    PbCb(&Message); //call matter callback to handle push button
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

#if (CFG_JOYSTICK_SUPPORTED == 1)
/**
 * @brief Joystick Up Action
 *
 * @param  None
 * @return None
 */
void APP_BSP_JoystickUpAction( void )
{
	ButtonDesc_t Message;
	Message.button = B1;
	Message.State = 1;
	if (APP_BSP_JoystickIsLongPressed()) {
	  Message.longPressed = 1;
	}
	else {
	  Message.longPressed = 0;
	}
	PbCb(&Message); //call matter callback to handle push button
}

/**
 * @brief Joystick Select Action
 *
 * @param  None
 * @return None
 */
void APP_BSP_JoystickSelectAction( void )
{
	 ButtonDesc_t Message;
	 Message.button = B2;
	 Message.State = 1;
	 if (APP_BSP_JoystickIsLongPressed())
	 {
	   Message.longPressed = 1;
	 }
	 else
	 {
	   Message.longPressed = 0;
	 }
	 PbCb(&Message); //call matter callback to handle push button
}

/**
 * @brief Joystick Right Action
 *
 * @param  None
 * @return None
 */
void APP_BSP_JoystickRightAction( void )
{
	 ButtonDesc_t Message;
	 Message.button = B3;
	 Message.State = 1;
	 if (APP_BSP_JoystickIsInitialPress())
	 {
	   Message.longPressed = 0;
	 }
	 else
	 {
	   if (APP_BSP_JoystickIsLongPressed())
	   {
	     Message.longPressed = 1;
	   }
	   else
	   {
		 Message.State = 0;
	   }
	 }
	 PbCb(&Message); //call matter callback to handle push button
}
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */

/**
 * @brief Wrapper for init function of the MM for the AMM
 *
 * @param p_PoolAddr: Address of the pool to use - Not use -
 * @param PoolSize: Size of the pool - Not use -
 *
 * @return None
 */
static void AMM_WrapperInit (uint32_t * const p_PoolAddr, const uint32_t PoolSize);

/**
 * @brief Wrapper for allocate function of the MM for the AMM
 *
 * @param BufferSize
 *
 * @return Allocated buffer
 */
static uint32_t * AMM_WrapperAllocate (const uint32_t BufferSize);

/**
 * @brief Wrapper for free function of the MM for the AMM
 *
 * @param p_BufferAddr
 *
 * @return None
 */
static void AMM_WrapperFree (uint32_t * const p_BufferAddr);
static void BPKA_Task(void *argument);
static void AMM_Background_Task(void *argument);
static void FM_Background_Task(void *argument);
static void HW_RNG_Process_Task(void *argument);


/* USER CODE BEGIN PFP */

#if (CFG_LOG_INSERT_TIME_STAMP_INSIDE_THE_TRACE != 0)
static void LogTimestamp(uint8_t * pData, uint16_t * piSize);
#endif /*CFG_LOG_INSERT_TIME_STAMP_INSIDE_THE_TRACE */
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief   System Initialisation.
 */
void MX_APPE_Config(void)
{
  /* Configure HSE Tuning */
  Config_HSE();
}

/**
 * @brief   Background Task for AMM.
 */
void AMM_Background_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(AmmBckgSemaphore, osWaitForever);
    AMM_BackgroundProcess();
    osThreadYield();
  }
}

/**
 * @brief   Background Task for Flash Manager.
 */
void FM_Background_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(FlashMangerReqSemaphore, osWaitForever);
    FM_BackgroundProcess();
    osThreadYield();
  }
}

/**
 * @brief   Background Task for BPKA.
 */
void BPKA_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(BpkaSemaphore, osWaitForever);
    osMutexAcquire(LinkLayerMutex, osWaitForever);
    BPKA_BG_Process();
    osMutexRelease(LinkLayerMutex);
    osThreadYield();
  }
}


/**
 * @brief   System Initialisation.
 */
uint32_t MX_APPE_Init(void *p_param)
{
  APP_DEBUG_SIGNAL_SET(APP_APPE_INIT);

  UNUSED(p_param);

  /* System initialization */
  System_Init();

  /* Configure the system Power Mode */
  SystemPower_Config();


  APP_DBG("FW info :\n");
  APP_DBG("**********************************************************\n");
  APP_DBG("PRODUCT NAME : " PRODUCT_NAME "\n"  );
  APP_DBG("VENDOR NAME : " VENDOR_NAME "\n" );
  #if defined(USE_STM32WBA65I_DK1) 
    APP_DBG("HARDWARE : STM32WBA65MM-DK\n" );
  #elif defined(STM32WBA65xx)
   	APP_DBG("HARDWARE : STM32WBA65xx\n" );
  #else
   	APP_DBG("HARDWARE : UNSPECIFIED\n" );
  #endif
  APP_DBG("SOFTWARE : X-CUBE-MATTER release revision " X_CUBE_MATTER_VERSION "\n" );
  APP_DBG("Embedded SW components :\n");
  APP_DBG("- Matter SDK version : " MATTER_SDK_VERSION "\n" );
  APP_DBG("**********************************************************\n");

#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1)
  /* Initialize the Temperature measurement */
  TEMPMEAS_Init ();
#endif /* (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1) */

  /* Initialize the Advance Memory Manager */
  AMM_Init (&ammInitConfig);

  /* Create thread for AMM background and semaphore to control it*/
  AmmBckgSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( AmmBckgSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : AMM BACKGROUND SEMAPHORE CREATION FAILED" );
    while(1);
  }
  
  AmmBckgTaskId = osThreadNew( AMM_Background_Task, NULL, &stAmmBckgTaskAttributes );
  if ( AmmBckgTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS :  AMM BACKGROUND TASK CREATION FAILED" );
    while(1);
  }
  
